[
    {
      "id": "1",
      "style": "American IPA",
      "description": "American-style India pale ales are perceived to have medium-high to intense hop bitterness, flavor and aroma with medium-high alcohol content. The style is further characterized by floral, fruity, citrus-like, piney, resinous, or sulfur-like American-variety hop character. Note that one or more of these American-variety hop characters is the perceived end, but the hop characters may be a result of the skillful use of hops of other national origins. The use of water with high mineral content results in a crisp, dry beer. This pale gold to deep copper-colored ale has a full, flowery hop aroma and may have a strong hop flavor (in addition to the perception of hop bitterness). India pale ales possess medium maltiness which contributes to a medium body. Fruity-ester flavors and aromas are moderate to very strong. Diacetyl can be absent or may be perceived at very low levels. Chill and/or hop haze is allowable at cold temperatures. (English and citrus-like American hops are considered enough of a distinction justifying separate American-style IPA and English-style IPA categories or subcategories. Hops of other origins may be used for bitterness or approximating traditional American or English character. See English-style India Pale Ale",
      "ibuMin": 50,
      "ibuMax": 70,
      "abvMin": 6.3,
      "abvMax": 7.5,
      "glassware": "Tulip",
      "servingTemp": "50-55°F",
      "foodSavoury": "Spicy Tuna Roll",
      "foodCheese": "Blue Cheese",
      "foodSweet": "Persimmon Rice Pudding"
    },
    {
        "id": "1",
        "style": "English IPA",
        "description": "Most traditional interpretations of English-style India pale ales are characterized by medium-high hop bitterness with a medium to medium-high alcohol content. Hops from a variety of origins may be used to contribute to a high hopping rate. Earthy and herbal English-variety hop character is the perceived end, but may be a result of the skillful use of hops of other national origins. The use of water with high mineral content results in a crisp, dry beer, sometimes with subtle and balanced character of sulfur compounds. This pale gold to deep copper-colored ale has a medium to high, flowery hop aroma and may have a medium to strong hop flavor (in addition to the hop bitterness). English-style India pale ales possess medium maltiness and body. Fruity-ester flavors and aromas are moderate to very strong. Diacetyl can be absent or may be perceived at very low levels. Chill haze is allowable at cold temperatures. Hops of other origins may be used for bitterness or approximating traditional English character.",
        "ibuMin": 35,
        "ibuMax": 63,
        "abvMin": 5.0,
        "abvMax": 7.0,
        "glassware": "Pint",
        "servingTemp": "45-50°F",
        "foodSavoury": "Fettucine Alfredo",
        "foodCheese": "Aged Cheddar",
        "foodSweet": "Ginger Spice Cake"
      },
      {
        "id": "1",
        "style": "New England IPA",
        "description": "Color: Straw to deep gold\r\n\r\nClarity: Low to very high degree of cloudiness is typical of these beers. Starch, yeast, hop, protein and/or other compounds contribute to a wide range of hazy appearance within this category.\r\n\r\nPerceived Malt Aroma & Flavor: Low to low-medium malt aroma and flavor may be present\r\n\r\nPerceived Hop Aroma & Flavor: Medium-high to very high hop aroma and flavor are present, with attributes typical of hops from any origin\r\n\r\nPerceived Bitterness: Medium-low to medium\r\n\r\nFermentation Characteristics: Low to medium fruity-estery aroma and ﬂavor may be present, but are usually overwhelmed by hop fruitiness. Diacetyl should not be perceived.\r\n\r\nBody: Medium-low to medium-high. Perceived silky or full mouthfeel may contribute to overall flavor profile.\r\n\r\nAdditional notes: Grist may include a small amount of oat, wheat or other adjuncts to promote haziness. Descriptors such as “juicy” are often used to describe the taste and aroma hop-derived attributes present in these beers.",
        "ibuMin": 50,
        "ibuMax": 70,
        "abvMin": 6.3,
        "abvMax": 7.5,
        "glassware": "Pint",
        "servingTemp": "45-55°F",
        "foodSavoury": "Hawaiian Pork Tenderloin",
        "foodCheese": "Goat Blue",
        "foodSweet": "Mache Creme Brulee"
      },
      {
        "id": "1",
        "style": "American Pale Ale",
        "description": "American pale ales range from deep golden to copper in color. The style is characterized by fruity, floral and citrus-like American-variety hop character producing medium to medium-high hop bitterness, flavor, and aroma. Note that the \"traditional\" style of this beer has its origins with certain floral, fruity, citrus-like, piney, resinous, or sulfur-like American hop varietals. One or more of these hop characters is the perceived end, but the perceived hop characters may be a result of the skillful use of hops of other national origins. American pale ales have medium body and low to medium maltiness. Low caramel character is allowable. Fruity-ester flavor and aroma should be moderate to strong. Diacetyl should be absent or present at very low levels. Chill haze is allowable at cold temperatures.",
        "ibuMin": 30,
        "ibuMax": 42,
        "abvMin": 4.5,
        "abvMax": 5.6,
        "glassware": "Tulip",
        "servingTemp": "45-55°F",
        "foodSavoury": "Roasted or Grilled Meats",
        "foodCheese": "Mild or Medium Cheddar",
        "foodSweet": "Apple Pie"
      },
      {
        "id": "1",
        "style": "English Pale Ale",
        "description": "Classic English pale ales are golden to copper colored and display earthy, herbal English-variety hop character. Note that \"earthy, herbal English-variety hop character\" is the perceived end, but may be a result of the skillful use of hops of other national origins. Medium to high hop bitterness, flavor, and aroma should be evident. This medium-bodied pale ale has low to medium malt flavor and aroma. Low caramel character is allowable. Fruity-ester flavors and aromas are moderate to strong. Chill haze may be in evidence only at very cold temperatures. The absence of diacetyl is desirable, though, diacetyl (butterscotch character) is acceptable and characteristic when at very low levels.",
        "ibuMin": 20,
        "ibuMax": 40,
        "abvMin": 4.5,
        "abvMax": 5.5,
        "glassware": "Pint",
        "servingTemp": "50-55°F",
        "foodSavoury": "Fish and Chips",
        "foodCheese": "English Style Cheese",
        "foodSweet": "Maple Bread Pudding"
      },
      {
        "id": "1",
        "style": "New England Pale Ale",
        "description": "Color: Straw to deep gold\r\n\r\nClarity: Low to very high degree of cloudiness is typical of these beers. Starch, yeast, hop, protein and/or other compounds contribute to a wide range of hazy appearance within this category.\r\n\r\nPerceived Malt Aroma & Flavor: Low to low-medium malt aroma and flavor may be present\r\n\r\nPerceived Hop Aroma & Flavor: Medium-high to very high hop aroma and flavor are present, with attributes typical of hops from any origin.\r\n\r\nPerceived Bitterness: Low to medium. Perceived impression of bitterness is soft and well-integrated into overall balance, and may differ significantly from measured or calculated IBU levels.\r\n\r\nFermentation Characteristics: Low to medium fruity-estery aroma and ﬂavor may be present, but are usually overwhelmed by hop fruitiness. Diacetyl should not be perceived.\r\n\r\nBody: Medium-low to medium-high. Perceived silky or full mouthfeel may contribute to overall flavor profile.\r\n\r\nAdditional notes: Grist may include a small amount of oat, wheat or other adjuncts to promote haziness. Descriptors such as “juicy” are often used to describe the taste and aroma hop-derived attributes present in these beers.",
        "ibuMin": 30,
        "ibuMax": 50,
        "abvMin": 4.4,
        "abvMax": 5.4,
        "glassware": "Tulip",
        "servingTemp": "50-55°F",
        "foodSavoury": "Spicy Tuna Roll",
        "foodCheese": "Blue Cheese",
        "foodSweet": "Persimmon Rice Pudding"
      },
      {
        "id": "1",
        "style": "Oatmeal Stout",
        "description": "Oatmeal stouts include oatmeal in their grist, resulting in a pleasant, full flavor and a smooth profile that is rich without being grainy. A roasted malt character which is caramel-like and chocolate-like should be evident - smooth and not bitter. Coffee-like roasted barley and roasted malt aromas (chocolate and nut-like) are prominent. Color is dark brown to black. Bitterness is moderate, not high. Hop flavor and aroma are optional but should not overpower the overall balance if present. This is a medium- to full- bodied beer, with minimal fruity esters. Diacetyl should be absent or at extremely low levels. Original gravity range and alcohol levels are indicative of English tradition of oatmeal stout.",
        "ibuMin": 20,
        "ibuMax": 40,
        "abvMin": 3.8,
        "abvMax": 6.0,
        "glassware": "Pint",
        "servingTemp": "50-55°F",
        "foodSavoury": "Chicken in Mole Sauce",
        "foodCheese": "Aged Cheddar",
        "foodSweet": "Sweet Potato Cheesecake"
      },
      {
        "id": "1",
        "style": "Dry Irish Stout",
        "description": "Dry stouts have an initial malt and light caramel flavor profile with a distinctive dry-roasted bitterness in the finish. Dry stouts achieve a dry-roasted character through the use of roasted barley. The emphasis of coffee-like roasted barley and a moderate degree of roasted malt aromas define much of the character. Some slight acidity may be perceived but is not necessary. European hop aroma and flavor should be low or not perceived. Dry stouts have medium-light to medium body. Fruity esters are minimal and overshadowed by malt, high hop bitterness, and roasted barley character. Diacetyl (butterscotch) should be very low or not perceived. Head retention and rich character should be part of its visual character.",
        "ibuMin": 30,
        "ibuMax": 40,
        "abvMin": 3.8,
        "abvMax": 5.0,
        "glassware": "Pint",
        "servingTemp": "50-55°F",
        "foodSavoury": "Ham",
        "foodCheese": "Irish Cheddar",
        "foodSweet": "Chocolate Desserts"
      },
      {
        "id": "1",
        "style": "Brown Porter",
        "description": "Brown porters are mid to dark brown (may have red tint) in color. No roast barley or strong burnt/black malt character should be perceived. Low to medium malt sweetness, caramel and chocolate is acceptable along with medium hop bitterness. This is a lightto medium-bodied beer. Fruity esters are acceptable. Hop flavor and aroma may vary from being negligible to medium in character.",
        "ibuMin": 20,
        "ibuMax": 30,
        "abvMin": 4.5,
        "abvMax": 6.0,
        "glassware": "Pint",
        "servingTemp": "50-55°F",
        "foodSavoury": "Roasted or Grilled Meats",
        "foodCheese": "Gruyere",
        "foodSweet": "Chocolate Peanut Butter Cookies"
      },
      {
        "id": "1",
        "style": "Imperial Porter",
        "description": "American-style imperial porters are black in color. No roast barley or strong burnt/astringent black malt character should be perceived. Medium malt, caramel and cocoa-like sweetness. Hop bitterness is perceived at a medium-low to medium level. Hop flavor and aroma may vary from being low to medium-high. This is a full bodied beer. Ale-like fruity esters should be evident but not overpowering and compliment hop character and malt derived sweetness. Diacetyl (butterscotch) levels should be absent.",
        "ibuMin": 35,
        "ibuMax": 50,
        "abvMin": 5.5,
        "abvMax": 9.5,
        "glassware": "Tulip",
        "servingTemp": "50-55°F",
        "foodSavoury": "Chicken Mole Enchilada",
        "foodCheese": "Smoked Gouda",
        "foodSweet": "Butterscotch Brownies"
      },
      {
        "id": "1",
        "style": "American Lager",
        "description": "Color: Straw to gold\r\n\r\nClarity: Appearance should be bright; chill haze should not be present\r\n\r\nPerceived Malt Aroma & Flavor: Medium-low to medium\r\n\r\nPerceived Hop Aroma & Flavor: Hop aroma and ﬂavor is medium to high. While traditional versions exhibit hop-derived attribute typical of noble-type hops, contemporary versions will exhibit hop and aroma attributes typical of a wide range of American hop varieties, including citrus, fruit-like or others.\r\n\r\nPerceived Bitterness: Medium to high\r\n\r\nFermentation Characteristics: DMS, fruity-estery and diacetyl aromas and flavors should be absent.\r\n\r\nBody: Medium-low to medium\r\n\r\nAdditional notes: Up to 25% corn and/or rice in the grist should be used. Beers in this category diverge from American-style lagers typical of the pre-Prohibition era by virtue of a wide range of hop aroma and flavor attributes.\r\nWhen using these guidelines as the basis for evaluating entries at competitions, organizers may wish to subcategorize this category into rice and corn subcategories, or may wish to group Pre-Prohibition and Contemporary American-Style Pilseners as subcategories.",
        "ibuMin": 25,
        "ibuMax": 40,
        "abvMin": 4.9,
        "abvMax": 6.0,
        "glassware": "Flute",
        "servingTemp": "40-45°F",
        "foodSavoury": "Pho",
        "foodCheese": "Smear Cheeses",
        "foodSweet": "Kettle Corn"
      },
      {
        "id": "1",
        "style": "Vienna Lager",
        "description": "Beers in this category are reddish brown or copper colored. They are medium in body. The beer is characterized by malty aroma and slight malt sweetness. The malt aroma and flavor should have a notable degree of toasted and/or slightly roasted malt character. Hop bitterness is clean and crisp. Noble-type hop aromas and flavors should be low or mild. Diacetyl, chill haze and ale-like fruity esters should not be perceived.",
        "ibuMin": 22,
        "ibuMax": 28,
        "abvMin": 4.8,
        "abvMax": 5.4,
        "glassware": "Flute",
        "servingTemp": "45-50°F",
        "foodSavoury": "Grilled Meats and Vegetables",
        "foodCheese": "Mild Cheeses",
        "foodSweet": "Almond Biscotti"
      },
      {
        "id": "1",
        "style": "Bohemian Pilsner",
        "description": "Traditional Bohemian Pilseners are medium bodied, and they can be as dark as a light amber color. This style balances moderate bitterness and noble-type hop aroma and flavor with a malty, slightly sweet, medium body. Extremely low levels of diacetyl and low levels of sweet corn-like dimethylsulfide (DMS) character, if perceived, are characteristic of this style and both may accent malt aroma. A toasted-, biscuit-like, bready malt character along with low levels of sulfur compounds may be evident. There should be no chill haze. Its head should be dense and rich.",
        "ibuMin": 30,
        "ibuMax": 45,
        "abvMin": 4.0,
        "abvMax": 5.0,
        "glassware": "Flute",
        "servingTemp": "40-45°F",
        "foodSavoury": "Shellfish",
        "foodCheese": "Mild White Cheddar",
        "foodSweet": "Shortbread Cookies"
      },
      {
        "id": "1",
        "style": "German Pilsner",
        "description": "A classic German Pilsener is very light straw or golden in color and well hopped. Perception of hop bitterness is medium to high. Noble-type hop aroma and flavor are moderate and quite obvious. It is a well-attenuated, medium-light bodied beer, but a malty residual sweetness can be perceived in aroma and flavor. Very low levels of sweet corn-like dimethylsulfide (DMS) character are below most beer drinkers' taste thresholds and are usually not detectable except to the trained or sensitive palate. Other fermentation or hop related sulfur compounds, when perceived at low levels, may be characteristic of this style. Fruity esters and diacetyl should not be perceived. There should be no chill haze. Its head should be dense and rich.",
        "ibuMin": 25,
        "ibuMax": 40,
        "abvMin": 4.0,
        "abvMax": 5.0,
        "glassware": "Flute",
        "servingTemp": "40-45°F",
        "foodSavoury": "Shellfish",
        "foodCheese": "Mild White Cheddar",
        "foodSweet": "Shortbread Cookies"
      },
      {
        "id": "1",
        "style": "Hefeweizen",
        "description": "The aroma and flavor of a Weissbier with yeast is decidedly fruity and phenolic. The phenolic characteristics are often described as clove-, nutmeg-like, mildly smoke-like or even vanilla-like. Banana-like esters should be present at low to medium-high levels. These beers are made with at least 50 percent malted wheat, and hop rates are quite low. Hop flavor and aroma are absent or present at very low levels. Weissbier is well attenuated and very highly carbonated and a medium to full bodied beer. The color is very pale to pale amber. Because yeast is present, the beer will have yeast flavor and a characteristically fuller mouthfeel and may be appropriately very cloudy. No diacetyl should be perceived.",
        "ibuMin": 10,
        "ibuMax": 15,
        "abvMin": 4.9,
        "abvMax": 5.5,
        "glassware": "Vase",
        "servingTemp": "40-45°F",
        "foodSavoury": "Seafood",
        "foodCheese": "Chèvre",
        "foodSweet": "Key Lime Pie"
      },
      {
        "id": "1",
        "style": "Witbier",
        "description": "Belgian white ales are very pale in color and are brewed using unmalted wheat and malted barley and are spiced with coriander and orange peel. Coriander and light orange peel aroma should be perceived as such or as an unidentified spiciness. Phenolic spiciness and yeast flavors may be evident at mild levels. These beers are traditionally bottle conditioned and served cloudy. An unfiltered starch and yeast haze should be part of the appearance. The low to medium body should have some degree of creaminess from wheat starch. The style is further characterized by the use of noble-type hops to achieve low hop bitterness and little to no apparent hop flavor. This beer has no diacetyl and a low to medium fruity-ester level. Mild acidity is appropriate.",
        "ibuMin": 10,
        "ibuMax": 17,
        "abvMin": 4.8,
        "abvMax": 5.2,
        "glassware": "Tulip",
        "servingTemp": "40-45°F",
        "foodSavoury": "Moules and Frites",
        "foodCheese": "Mascarpone",
        "foodSweet": "Panna Cotta"
      },
      {
        "id": "1",
        "style": "Sour",
        "description": "American sour ales can be very light to black or take on the color of added fruits or other ingredients. There is no Brettanomyces character in this style of beer. Wood- and barrel-aged sour ales are classified elsewhere. If acidity is present it is usually in the form of lactic, acetic and other organic acids naturally developed with acidified malt in the mash or in fermentation by the use of various microorganisms including certain bacteria and yeasts. Acidic character can be a complex balance of several types of acid and characteristics of age. The evolution of natural acidity develops balanced complexity. Residual flavors that come from liquids previously aged in a barrel such as bourbon or sherry should not be present. Wood vessels may be used during the fermentation and aging process, but wood-derived flavors such as vanillin must not be present. In darker versions, roasted malt, caramel-like and chocolate-like characters should be subtle in both flavor and aroma. American sour may have evident full range of hop aroma and hop bitterness with a full range of body. Estery and fruity-ester characters are evident, sometimes moderate and sometimes intense, yet balanced. Diacetyl and sweet corn-like dimethylsulfide (DMS) should not be perceived. Chill haze, bacteria and yeast-induced haze are allowable at low to medium levels at any temperature. Fruited American-Style Sour Ales will exhibit fruit flavors in harmonious balance with other characters.",
        "ibuMin": "Varies",
        "ibuMax": "Varies",
        "abvMin": "Varies",
        "abvMax": "Varies",
        "glassware": "Goblet",
        "servingTemp": "40-50°F",
        "foodSavoury": "Varies",
        "foodCheese": "Strong Cheeses",
        "foodSweet": "Creamy Desserts with Fruit"
      },
      {
        "id": "1",
        "style": "Gose",
        "description": "Contemporary Goses are straw to medium amber, or, may take on the hue of added fruits or other ingredients if present. Appearance is cloudy/hazy with yeast character, and may have evidence of continued fermentation activity. A wide variety of herbal, spice, floral or fruity aromas other than found in traditional Leipzig-Style Gose are present, in harmony with other aromas. Horsey, leathery or earthy aromas contributed by Brettanomyces yeasts may be evident but have a very low profile, as this beer is not excessively aged. Hop aroma is not perceived. Malt sweetness is not perceived to very low. They typically contain malted barley and unmalted wheat, with some traditional varieties containing oats. Hop flavor is not perceived. Hop bitterness is not perceived. A wide variety of herbal, spice, floral or fruity flavors other than found in traditional Leipzig-Style Gose, are present in harmony with the overall flavor profile. Salt (table salt) character is traditional in low amounts, but may vary from absent to present in Contemporary Gose. Horsey, leathery or earthy flavors contributed by Brettanomyces yeasts may be evident but have a very low profile, as this beer is not excessively aged. Contemporary Gose may be fermented with pure beer yeast strains, or with yeast mixed with bacteria. Contemporary Gose may be spontaneously fermented, similarly to Belgian-style gueuze/lambic beers, and should exhibit complexity of acidic, flavor and aroma contributed by introduction of wild yeast and bacteria into the fermentation. Low to medium lactic acid character is evident in all examples as sharp, refreshing sourness. A primary difference between Belgian Gueuze and Gose is that Gose is served at a much younger age. Gose is typically enjoyed fresh and carbonated. Overall complexity of flavors and aromas sought while maintaining a balance between acidity, yeast-enhanced spice and refreshment is ideal. Body is low to medium-low.",
        "ibuMin": 5,
        "ibuMax": 15,
        "abvMin": 4.4,
        "abvMax": 5.4,
        "glassware": "Flute",
        "servingTemp": "40-50°F",
        "foodSavoury": "Watermelon Salad",
        "foodCheese": "Queso Fresco",
        "foodSweet": "Greek Yogurt"
      }
    ]